help_message = f'''Для того щоб використовувати бота натисніть кнопку "Поїхали!🚀" на панелі.
                    Якщо ви вже почали роботу, але зробили десь помилку, то для того, щоб повернутись на початок натисніть "⬅️ Все спочатку".
                    Дайте відповіді на всі запитання і Reddit бот почне працювати.'''

start_message = 'Вітаю! Цей бот потрібен для накрутки апвоутів та написання коментарів у Reddit.\n' + help_message

hi_user = 'Вітаю, '

# __________________________________ button _________________________________________#
btn_reset = "⬅️ Все спочатку"
btn_run_work = 'Поїхали!🚀'

# ___________________________________ FMS State _______________________________________________ #
reset_msg = 'Cancelled.'

reddit_link = "Надішли посилання на пост Reddit."

upvote_int = "Введіть кількість upvote."
error_vote_int = "Помилка! Ваша відповідь не є цілим числом./Введіть кількість upvote.(тільки ціле число)"

# comments_int = "Кількість коментарів (якщо потрібно)"
error_comments_int = "Помилка! Ваша відповідь не є цілим числом./Кількість коментарів (якщо потрібно).(тільки ціле число)"


# ___________________________ message for notification about finsh process ______________________ #
notif_browser_run = 'Браузер почав працювати для опрацювання вашого посилання'
start_process = "Виконую..."
finish_process = "Зробив!"


# ___________________________ deleted post______________________________
deleted_post = "Пост був видалиний."
not_enough_bots = "Недостатньо акаунтів, щоб продовжувати робити апвоути. "

