# _________________________ msg actions with add/del users ___________________#
# NoChance
deleted_user = "видалено 🦉"
user_denied = "Такого юзера не існує 🙉"
added_user = "наданий доступ до бота 👑"
has_access = 'Юзер вже має доступ 🙉'
has_many_user = "У вас більше 3 юзерів! 🙉"

# ________________________________________ handlers _____________________________________ #
cmd_admin = 'You are the admin!\n' \
            'Подивитися усіх юзерів - /all_users\n' \
            'Додати юзера - /add_user\n'\
            'Видалити юзера - /delete_user\n'

send_username = "Надішли username 🧸"

